Infineon/mtb-example-psoc6-usb-msc-filesystem-freertos/source/usb_comm.c
/*****************************************************************************
* File Name: usb_comm.c
*
* Description:
*  This file provides the source code to implement the USB Mass Storage
*  class requests.
*
* Note:
*
******************************************************************************
* Copyright 2020-2021, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
*
* This software, including source code, documentation and related
* materials ("Software") is owned by Cypress Semiconductor Corporation
* or one of its affiliates ("Cypress") and is protected by and subject to
* worldwide patent protection (United States and foreign),
* United States copyright laws and international treaty provisions.
* Therefore, you may use this Software only as provided in the license
* agreement accompanying the software package from which you
* obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software
* source code solely for use in connection with Cypress's
* integrated circuit products.  Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*****************************************************************************/
#include <stdio.h>
#include "usb_comm.h"
#include "usb_scsi.h"

#include "cy_sysint.h"
#include "cyhal.h"
#include "cycfg.h"
#include "cycfg_usbdev.h"

#include "sd_card.h"

#include "FreeRTOS.h"
#include "task.h"

/*******************************************************************************
* Constants
*******************************************************************************/
#define USB_COMM_DEVICE_ID          0
#define USB_COMM_SUSPEND_COUNT      3
#define USB_COMM_CBW_FLAG_DIR_IN    0x80
#define USB_COMM_CBS_PHASE_ERROR    0x02
#define USB_COMM_TIMEOUT            2000

/***************************************************************************
* USB Interrupt Handlers
***************************************************************************/
static void usb_high_isr(void);
static void usb_medium_isr(void);
static void usb_low_isr(void);
void usb_timer_handler(void *arg, cyhal_timer_event_t event);

/*******************************************************************************
* Global Variables
*******************************************************************************/
/* USB Interrupt Configuration */
const cy_stc_sysint_t usb_high_interrupt_cfg =
{
    .intrSrc = (IRQn_Type) usb_interrupt_hi_IRQn,
    .intrPriority = 5U,
};
const cy_stc_sysint_t usb_medium_interrupt_cfg =
{
    .intrSrc = (IRQn_Type) usb_interrupt_med_IRQn,
    .intrPriority = 6U,
};
const cy_stc_sysint_t usb_low_interrupt_cfg =
{
    .intrSrc = (IRQn_Type) usb_interrupt_lo_IRQn,
    .intrPriority = 7U,
};

/* USBDEV context variables */
cy_stc_usbfs_dev_drv_context_t  usb_drvContext;
cy_stc_usb_dev_context_t        usb_devContext;
cy_stc_usb_dev_msc_context_t    usb_mscContext;

/* USB MSC specific variables */
uint8_t msc_lun = 0;
uint8_t msc_reset = 0;

/* USB Timer variables */
cyhal_timer_t usb_timer;
cyhal_timer_cfg_t usb_timer_cfg =
{
    .is_continuous = true,
    .period        = 10000
};

/* Mass storage device interfaces */
cy_stc_mass_storage_dev_t disk_fops = {
  sd_card_is_connected,
  sd_card_init,
  sd_card_sector_size,
  sd_card_max_sector_num,
  sd_card_total_mem_bytes,
  sd_card_read,
  sd_card_write,
};

volatile bool usb_suspended = false;
volatile uint32_t usb_idle_counter = 0;

uint8_t *usb_fs = NULL;

extern uint8_t forceOS;
extern uint8_t statusFileTimer;

/*******************************************************************************
* Function Prototypes
********************************************************************************/
static void usb_comm_msc_out_ep_cb(USBFS_Type *base, uint32_t endpointAddr, uint32_t errorType, struct cy_stc_usbfs_dev_drv_context *context);
static void usb_comm_msc_in_ep_cb(USBFS_Type *base, uint32_t endpointAddr, uint32_t errorType, struct cy_stc_usbfs_dev_drv_context *context);
static cy_en_usb_dev_status_t usb_msc_request_received (cy_stc_usb_dev_control_transfer_t *transfer, void *classContext, cy_stc_usb_dev_context_t *devContext);
static cy_en_usb_dev_status_t usb_msc_request_completed(cy_stc_usb_dev_control_transfer_t *transfer, void *classContext, cy_stc_usb_dev_context_t *devContext);
static uint8 is_command_block_wrapper_valid(cy_stc_usb_dev_msc_context_t *context);
static void usb_high_isr(void);
static void usb_medium_isr(void);
static void usb_low_isr(void);
void usb_timer_handler(void *arg, cyhal_timer_event_t event);

/*******************************************************************************
* Function Name: usb_comm_timeout_handler
********************************************************************************
* Summary:
*   USB timeout handler based on FreeRTOS.
*
*******************************************************************************/
static int32_t usb_comm_timeout_handler(int32_t ms)  
{  
     vTaskDelay(1/portTICK_PERIOD_MS);  
     return --ms;  
} 

