Infineon/mtb-example-psoc6-usb-msc-filesystem-freertos/source/usb_comm.c
/*******************************************************************************
* Function Name: usb_comm_init
********************************************************************************
* Summary:
*   Initializes the USBFS hardware block and its interrupts.
*
*******************************************************************************/
void usb_comm_init(void)
{
    /* Init the USB Block */
    Cy_USB_Dev_Init(CYBSP_USBDEV_HW,
                    &CYBSP_USBDEV_config,
                    &usb_drvContext,
                    &usb_devices[USB_COMM_DEVICE_ID],
                    &usb_devConfig,
                    &usb_devContext);

    /* Init the Mass Storage Device Class */
    Cy_USB_Dev_Msc_Init(NULL,
                        &usb_mscContext,
                        &usb_devContext);
                        
    /* Add Storage callbacks for Mass Storage Device Class */
    usb_mscContext.p_user_data = &disk_fops;
    usb_mscContext.block_size = ((cy_stc_mass_storage_dev_t *)usb_mscContext.p_user_data)->get_block_size();
    usb_mscContext.block_num = ((cy_stc_mass_storage_dev_t *)usb_mscContext.p_user_data)->get_block_num();
    usb_mscContext.mem_size = ((cy_stc_mass_storage_dev_t *)usb_mscContext.p_user_data)->get_mem_size();

    /* Register MSC data endpoint callbacks */
    Cy_USBFS_Dev_Drv_RegisterEndpointCallback(CYBSP_USBDEV_HW, MSC_IN_ENDPOINT, usb_comm_msc_in_ep_cb, &usb_drvContext);
    Cy_USBFS_Dev_Drv_RegisterEndpointCallback(CYBSP_USBDEV_HW, MSC_OUT_ENDPOINT, usb_comm_msc_out_ep_cb, &usb_drvContext);

    /* Register Mass Storage Callbacks */
    Cy_USB_Dev_Msc_RegisterUserCallback(usb_msc_request_received, usb_msc_request_completed, &usb_mscContext);

    /* Initialize the USB interrupts */
    Cy_SysInt_Init(&usb_high_interrupt_cfg,   &usb_high_isr);
    Cy_SysInt_Init(&usb_medium_interrupt_cfg, &usb_medium_isr);
    Cy_SysInt_Init(&usb_low_interrupt_cfg,    &usb_low_isr);

    /* Init the timer to detect USB activity */
    cyhal_timer_init(&usb_timer, NC, NULL);
    cyhal_timer_configure(&usb_timer, &usb_timer_cfg);
    cyhal_timer_register_callback(&usb_timer, usb_timer_handler, NULL);
    cyhal_timer_enable_event(&usb_timer, CYHAL_TIMER_IRQ_TERMINAL_COUNT, CYHAL_ISR_PRIORITY_DEFAULT, true);

    /* Overwrite the timeout handler */
    Cy_USB_Dev_OverwriteHandleTimeout(usb_comm_timeout_handler, &usb_devContext);
}

/*******************************************************************************
* Function Name: usb_comm_connect
********************************************************************************
* Summary:
*   Starts USB enumeration.
*
*******************************************************************************/
void usb_comm_connect(void)
{
    /* Enable the USB interrupts */
    NVIC_EnableIRQ(usb_high_interrupt_cfg.intrSrc);
    NVIC_EnableIRQ(usb_medium_interrupt_cfg.intrSrc);
    NVIC_EnableIRQ(usb_low_interrupt_cfg.intrSrc);

    /* Make device appear on the bus. This function call is blocking,
       it waits till the device enumerates */
    Cy_USB_Dev_Connect(true, CY_USB_DEV_WAIT_FOREVER, &usb_devContext);

    /* Start the internal timer to check for activity */
    cyhal_timer_start(&usb_timer);

    /* Enable the OUT Endpoint */
    Cy_USB_Dev_StartReadEp(MSC_OUT_ENDPOINT, &usb_devContext);
}

/*******************************************************************************
* Function Name: usb_comm_is_ready
********************************************************************************
* Summary:
*   Verifies if the USB is enumerated.
*
*******************************************************************************/
bool usb_comm_is_ready(void)
{
    return (Cy_USB_Dev_GetConfiguration(&usb_devContext));
}

/*******************************************************************************
* Function Name: usb_comm_refresh
********************************************************************************
* Summary:
*   Force the OS to reenumerate.
*
*******************************************************************************/
void usb_comm_refresh(void)
{
    forceOS = true;
    statusFileTimer = 0;
}

/*******************************************************************************
* Function Name: usb_comm_process
********************************************************************************
* Summary:
*   Process any pending requests from USB.
*
*******************************************************************************/
void usb_comm_process(void)
{
    /* Storage device Status */
    if(!((cy_stc_mass_storage_dev_t *)usb_mscContext.p_user_data)->is_connected()) 
    {
        storageRemovedFlag = true;
    } else 
    {
        storageRemovedFlag = false;
    }

    /* Check the USB configuration */
    if(Cy_USB_Dev_IsConfigurationChanged(&usb_devContext)) 
    {
        usb_mscContext.state = CY_USB_DEV_MSC_READY_STATE;
        /* Enable the OUT Endpoint */
        Cy_USB_Dev_StartReadEp(MSC_OUT_ENDPOINT, &usb_devContext);
    }
    
}

/*******************************************************************************
* Function Name: usb_comm_msc_out_ep_cb
********************************************************************************
* Summary:
*   This is the MSC OUT endpoint handler callback.
*
*******************************************************************************/
static void usb_comm_msc_out_ep_cb(USBFS_Type *base, uint32_t endpointAddr, uint32_t errorType, struct cy_stc_usbfs_dev_drv_context *context)
{
    uint32_t actCount = 0;
    uint32_t tempVar = 0;
    cy_en_usb_dev_status_t status = CY_USB_DEV_REQUEST_NOT_HANDLED;

    if(endpointAddr != MSC_OUT_ENDPOINT) {
        return;
    }
     /* Read the data from the OUT endpoint */
    if(CY_USB_DEV_SUCCESS != Cy_USB_Dev_ReadEpNonBlocking(MSC_OUT_ENDPOINT, usb_mscContext.out_buffer, 
                                CY_USB_DEV_MSC_EP_BUF_SIZE, &actCount, context->devConext)) {
        return;
    }
    /* Command Block Wrapper (CBW) */
    if(CY_USB_DEV_MSC_READY_STATE == usb_mscContext.state) {
        if(actCount != CY_USB_DEV_MSC_CMD_BLOCK_SIZE) {
            /* Stall OUT endpoint */
            Cy_USBFS_Dev_Drv_StallEndpoint(base, MSC_OUT_ENDPOINT, context);
            return;
        }
        /* Check the CBW data  */
        if(CY_USB_DEV_SUCCESS != is_command_block_wrapper_valid(&usb_mscContext)) {
            Cy_USBFS_Dev_Drv_StallEndpoint(base, MSC_OUT_ENDPOINT, context);
            Cy_USBFS_Dev_Drv_StallEndpoint(base, MSC_IN_ENDPOINT, context);
            return;
        }
        usb_mscContext.cmd_status.tag = usb_mscContext.cmd_block.tag;
        usb_mscContext.cmd_status.data_residue = usb_mscContext.cmd_block.data_transfer_length;

