Infineon/mtb-example-psoc6-usb-msc-filesystem-freertos/source/usb_comm.c
        /* The number of bytes of transfer data is 0 */
        if(usb_mscContext.cmd_block.data_transfer_length == 0) {
            switch (usb_mscContext.cmd_block.cmd[0]) {
                case CY_USB_DEV_MSC_SCSI_TEST_UNIT_READY:
                    status = usb_scsi_test_unit_ready();
                    break;
                case CY_USB_DEV_MSC_SCSI_MEDIA_REMOVAL:
                    status = usb_scsi_prevent_media_removal(usb_mscContext.cmd_block.cmd[4]);
                    break;
                case CY_USB_DEV_MSC_SCSI_START_STOP_UNIT:
                    status = usb_scsi_start_stop_unit(usb_mscContext.cmd_block.cmd[4]);
                    break;
                default:
                    break;
            }
            usb_mscContext.cmd_status.status = status;
            /* Send CSW */
            if(CY_USB_DEV_SUCCESS == Cy_USB_Dev_WriteEpNonBlocking(MSC_IN_ENDPOINT, (const uint8_t *)&(usb_mscContext.cmd_status), CY_USB_DEV_MSC_CMD_STATUS_SIZE, context->devConext)) {
                usb_mscContext.state = CY_USB_DEV_MSC_STATUS_TRANSPORT;
            }
            Cy_USB_Dev_StartReadEp(MSC_OUT_ENDPOINT, context->devConext);
            return;
        }

        /*  Start a reading on OUT endpoint */
        Cy_USB_Dev_StartReadEp(MSC_OUT_ENDPOINT, context->devConext);

        /* Data-In from the device to the host */
        if ((usb_mscContext.cmd_block.flags & USB_COMM_CBW_FLAG_DIR_IN) == USB_COMM_CBW_FLAG_DIR_IN) {
            switch (usb_mscContext.cmd_block.cmd[0]) {
                /* SCSI Read command (10) */
                case CY_USB_DEV_MSC_SCSI_READ10:
                    tempVar = ((usb_mscContext.cmd_block.cmd[2] << 24) | (usb_mscContext.cmd_block.cmd[3] << 16) | (usb_mscContext.cmd_block.cmd[4] << 8) | (usb_mscContext.cmd_block.cmd[5]));
                    usb_mscContext.start_location = tempVar * MSC_BLOCKSIZE;
                    tempVar = ((usb_mscContext.cmd_block.cmd[7] << 8) | (usb_mscContext.cmd_block.cmd[8]));
                    usb_mscContext.bytes_to_transfer = tempVar * MSC_BLOCKSIZE;
                    usb_mscContext.dev_data_len = 0;
                    if (usb_mscContext.cmd_block.data_transfer_length != usb_mscContext.bytes_to_transfer) {
                        usb_mscContext.cmd_status.status = USB_COMM_CBS_PHASE_ERROR;
                        /* Stall OUT endpoint */
                        Cy_USBFS_Dev_Drv_StallEndpoint(base, MSC_OUT_ENDPOINT, context);
                        usb_mscContext.state = CY_USB_DEV_MSC_READY_STATE;
                        return;
                    }
                    status = usb_scsi_read_10(&usb_mscContext);
                    break;
                case CY_USB_DEV_MSC_SCSI_REQUEST_SENSE:
                    status = usb_scsi_request_sense(&usb_mscContext);
                    break;

                case CY_USB_DEV_MSC_SCSI_INQUIRY:
                    status = usb_scsi_inquiry(&usb_mscContext);
                    break;

                case CY_USB_DEV_MSC_SCSI_MODE_SENSE6:
                    status = usb_scsi_mode_sense_6(&usb_mscContext);
                    break;

                case CY_USB_DEV_MSC_SCSI_MODE_SENSE10:
                    status = usb_scsi_mode_sense_10(&usb_mscContext);
                    break;

                case CY_USB_DEV_MSC_SCSI_READ_CAPACITY:
                    status = usb_scsi_read_capacity(&usb_mscContext);
                    break;

                case CY_USB_DEV_MSC_SCSI_READ_FORMAT_CAPACITIES:
                    status = usb_scsi_read_format_capacities(&usb_mscContext);
                    break;

                case CY_USB_DEV_MSC_SCSI_FORMAT_UNIT:
                    status = usb_scsi_format_unit(&usb_mscContext);
                    break;

                case CY_USB_DEV_MSC_SCSI_MODE_SELECT6:
                    status = usb_scsi_mode_select_6(&usb_mscContext);
                    break;

                case CY_USB_DEV_MSC_SCSI_MODE_SELECT10:
                    status = usb_scsi_mode_select_10(&usb_mscContext);
                    break;

                default:
                    usb_mscContext.state = CY_USB_DEV_MSC_READY_STATE;
                    break;
            }
            if (status == CY_USB_DEV_SUCCESS) {
                /* Send command data */
                if(CY_USB_DEV_SUCCESS == Cy_USB_Dev_WriteEpNonBlocking(MSC_IN_ENDPOINT, usb_mscContext.in_buffer, usb_mscContext.packet_in_size, context->devConext)) {
                    usb_mscContext.state = CY_USB_DEV_MSC_DATA_IN;
                }
                usb_mscContext.cmd_status.status = status;
            }
        /* Data-Out from host to the device */
        } else {
            /* SCSI Write (10) or Verify (10) */
            if((usb_mscContext.cmd_block.cmd[0] == CY_USB_DEV_MSC_SCSI_WRITE10) || (usb_mscContext.cmd_block.cmd[0] == CY_USB_DEV_MSC_SCSI_VERIFY10)) {
                /* Get the block address */
                tempVar = ((usb_mscContext.cmd_block.cmd[2] << 24) | (usb_mscContext.cmd_block.cmd[3] << 16) | (usb_mscContext.cmd_block.cmd[4] << 8) | (usb_mscContext.cmd_block.cmd[5]));
                usb_mscContext.start_location = tempVar * MSC_BLOCKSIZE;
                /* Get the block num */
                tempVar = ((usb_mscContext.cmd_block.cmd[7] << 8) | (usb_mscContext.cmd_block.cmd[8]));
                usb_mscContext.bytes_to_transfer = tempVar * MSC_BLOCKSIZE;
                usb_mscContext.dev_data_len = 0;
                /* Check the transfer length */
                if(usb_mscContext.cmd_block.data_transfer_length != usb_mscContext.bytes_to_transfer) {
                    usb_mscContext.cmd_status.status = USB_COMM_CBS_PHASE_ERROR;
                    /* Stall OUT endpoint */
                    Cy_USBFS_Dev_Drv_StallEndpoint(base, MSC_OUT_ENDPOINT, context);
                    return;
                }
                usb_mscContext.state = CY_USB_DEV_MSC_DATA_OUT;
            }
        }
    /* Data OUT transfer */
    } else if(CY_USB_DEV_MSC_DATA_OUT == usb_mscContext.state) {
        usb_mscContext.packet_out_size = actCount;
        if(CY_USB_DEV_MSC_SCSI_WRITE10 == usb_mscContext.cmd_block.cmd[0]) {
            usb_scsi_write_10(&usb_mscContext);
        } else if(CY_USB_DEV_MSC_SCSI_VERIFY10 == usb_mscContext.cmd_block.cmd[0]) {
            usb_scsi_verify_10(&usb_mscContext);
        }
        /* Transfer completed, Send CSW */
        if (usb_mscContext.state == CY_USB_DEV_MSC_STATUS_TRANSPORT) {
            if(CY_USB_DEV_SUCCESS == Cy_USB_Dev_WriteEpNonBlocking(MSC_IN_ENDPOINT, (const uint8_t *)&(usb_mscContext.cmd_status), CY_USB_DEV_MSC_CMD_STATUS_SIZE, context->devConext)) {
                usb_mscContext.state = CY_USB_DEV_MSC_STATUS_TRANSPORT;
            }
        }
        Cy_USB_Dev_StartReadEp(MSC_OUT_ENDPOINT, context->devConext);
    }
}

