Infineon/mtb-example-psoc6-usb-msc-filesystem-freertos/source/usb_comm.c
/*******************************************************************************
* Function Name: usb_comm_msc_in_ep_cb
********************************************************************************
* Summary:
*   The MSC IN endpoint data handler callback.
*
*******************************************************************************/
static void usb_comm_msc_in_ep_cb(USBFS_Type *base, uint32_t endpointAddr, uint32_t errorType, struct cy_stc_usbfs_dev_drv_context *context)
{
    cy_en_usb_dev_status_t status = CY_USB_DEV_REQUEST_NOT_HANDLED;

    if(MSC_IN_ENDPOINT != (endpointAddr&0x7F)) {
        return;
    }

    /* Send the CSW completed */
    if(CY_USB_DEV_MSC_STATUS_TRANSPORT == usb_mscContext.state) 
    {
        usb_mscContext.state = CY_USB_DEV_MSC_READY_STATE;
    /* Send the data completed */
    } else if(CY_USB_DEV_MSC_DATA_IN == usb_mscContext.state) {
        if(CY_USB_DEV_MSC_SCSI_READ10 != usb_mscContext.cmd_block.cmd[0]) {
            usb_mscContext.cmd_status.data_residue -= usb_mscContext.packet_in_size;
            /* Send CSW */
            if(CY_USB_DEV_SUCCESS == Cy_USB_Dev_WriteEpNonBlocking(MSC_IN_ENDPOINT, (const uint8_t *)&(usb_mscContext.cmd_status), 
                                                                   CY_USB_DEV_MSC_CMD_STATUS_SIZE, context->devConext)) {
                usb_mscContext.state = CY_USB_DEV_MSC_STATUS_TRANSPORT;
            }
        } else {
            usb_mscContext.cmd_status.data_residue -= usb_mscContext.packet_in_size;
            usb_mscContext.start_location += usb_mscContext.packet_in_size;
            usb_mscContext.bytes_to_transfer -= usb_mscContext.packet_in_size;
            if (usb_mscContext.bytes_to_transfer != 0) {
                status = usb_scsi_read_10(&usb_mscContext);
                if (status == CY_USB_DEV_SUCCESS) {
                    /* Send command data */
                    if(CY_USB_DEV_SUCCESS == Cy_USB_Dev_WriteEpNonBlocking(MSC_IN_ENDPOINT, usb_mscContext.in_buffer, 
                                                                usb_mscContext.packet_in_size, context->devConext)) {
                        //TODO...
                    }
                }
                usb_mscContext.cmd_status.status = status;
            } else {
                /* All IN data send completed, send CSW */
                if(CY_USB_DEV_SUCCESS == Cy_USB_Dev_WriteEpNonBlocking(MSC_IN_ENDPOINT, (const uint8_t *)&(usb_mscContext.cmd_status), 
                                                                       CY_USB_DEV_MSC_CMD_STATUS_SIZE, context->devConext)) {
                    usb_mscContext.state = CY_USB_DEV_MSC_STATUS_TRANSPORT;
                }
            }
        }
    }
}

/*******************************************************************************
* Function Name: is_command_block_wrapper_valid
********************************************************************************
* Summary:
*   Check for validity of the Command Block Wrapper (CBW).
*
* Parameters:
*   context: USB MSC context
*
* Return:
*   Success if valid.
* 
*******************************************************************************/
static uint8 is_command_block_wrapper_valid(cy_stc_usb_dev_msc_context_t *context)
{
    cy_en_usb_dev_status_t validStatus = CY_USB_DEV_BAD_PARAM;
    uint8 index = 0;

    for(index = 0; index < CY_USB_DEV_MSC_CMD_BLOCK_SIZE; index++)
    {
        /* Copy all contents from EP buffer to structure. May replace with DMA,
         * need to validate if efficiency can be increased in that way. */
        *((uint8 *)&context->cmd_block + index) = context->out_buffer[index];
    }

    if(context->cmd_block.signature == MSC_CBW_SIGNATURE)
    {
        if(context->cmd_block.lun <= 0)
        {
            if((context->cmd_block.length > 0) && (context->cmd_block.length <= CY_USB_DEV_MSC_CMD_SIZE))
            {
                /* Validate all conditions of section 6.6.1 of MSC spec. */
                validStatus = CY_USB_DEV_SUCCESS;
            }
        }
    }
    return(validStatus);
}

/*******************************************************************************
* Function Name: usb_msc_request_received
********************************************************************************
* Summary:
*   Callback implementation for the MSC Request Received.
*
* Parameters:
*   transfer: contain information about the transfer
*   classContext: pointer to the class context
*   devContext: USB device context
*
* Return:
*   Success if supported request received.
*
*******************************************************************************/
static cy_en_usb_dev_status_t usb_msc_request_received(cy_stc_usb_dev_control_transfer_t *transfer, void *classContext, cy_stc_usb_dev_context_t *devContext)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

    if (transfer->setup.bmRequestType.type == CY_USB_DEV_CLASS_TYPE)
    {
        switch (transfer->setup.bRequest)
        {
            case CY_USB_DEV_MSC_GET_MAX_LUN:
                transfer->remaining = 0x01;
                transfer->ptr = &msc_lun;
                retStatus = CY_USB_DEV_SUCCESS;
                break;
            case CY_USB_DEV_MSC_RESET:
                transfer->notify = true;
                transfer->ptr = &msc_reset;
                transfer->remaining = 0x01;
                retStatus = CY_USB_DEV_SUCCESS;
                break;
            default:
                break;
        }
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: usb_msc_request_completed
********************************************************************************
* Summary:
*   Callback implementation for MSC Msc Request Completed. Not used in this
*   example.
*
* Parameters:
*   transfer: contain information about the transfer
*   classContext: pointer to the class context
*   devContext: USB device context
*
* Return:
*   Not handled. 
*
*******************************************************************************/
static cy_en_usb_dev_status_t usb_msc_request_completed(cy_stc_usb_dev_control_transfer_t *transfer,
                                                         void *classContext,
                                                         cy_stc_usb_dev_context_t *devContext)
{
    cy_en_usb_dev_status_t retStatus = CY_USB_DEV_REQUEST_NOT_HANDLED;

